#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgerBangsLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C
// 0x1560 (0x1890 - 0x0330)
class UBadgerBangsLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0338(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0368(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x03F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0420(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x04A8(0x0030)()
	float                                         Pitch;                                             // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648B[0x4];                                     // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x04E8(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0570(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x05F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0628(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x06B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x06E0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0758(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0788(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0800(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0830(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x08A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x08D8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0950(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0980(0x0240)(NoDestructor)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0BC0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0C48(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0C78(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0D00(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0D30(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0DB8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0DE8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0E18(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0E48(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0E78(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0EA8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0ED8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0F08(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0F38(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0F68(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0F98(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0FC8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0FF8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1080(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x10B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1138(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1168(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x11F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1220(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x12A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x12D8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1360(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1390(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1418(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1448(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x14D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1500(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1588(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x15B8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1640(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1670(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x16F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1728(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x17B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x17E0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1858(0x0030)()

public:
	void ExecuteUbergraph_BadgerBangsLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ItemSwimJumpStart(struct FPoseLink* Param_ItemSwimJumpStart);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* Param_ItemLowerBodyJogPostPivot);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* Param_ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* Param_ItemLowerBodyJogStop);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* Param_ItemLowerBodyJogStart);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* Param_ItemLowerBodyLeanAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* Param_ItemLowerBodyMovement);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* Param_ItemJogPostPivotAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* Param_ItemJogPrePivotAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* Param_ItemJogStopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* Param_ItemJogStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* Param_ItemFlyModeLoopAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* Param_ItemFlyModeStartAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* Param_ItemZipLineStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* Param_ItemJetPackJumpAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* Param_ItemJetPackStartAdditive);
	void ItemFallLandAdditive(struct FPoseLink* Param_ItemFallLandAdditive);
	void ItemFallAdditive(struct FPoseLink* Param_ItemFallAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* Param_ItemJumpLoopAdditive);
	void ItemJumpUpAdditive(struct FPoseLink* Param_ItemJumpUpAdditive);
	void ItemSlopeSliding(struct FPoseLink* Param_ItemSlopeSliding);
	void ItemCrouchTurningAdditive(struct FPoseLink* Param_ItemCrouchTurningAdditive);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* Param_ItemIdleAdditive);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* Param_ItemFullBodySprint);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& Param_InputParam, struct FPoseLink* Param_ItemUpperBody);
	void ItemSwimJumpStartLoop(struct FPoseLink* Param_ItemSwimJumpStartLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* Param_ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* Param_ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* Param_ItemSwimJumpSurfaceEnd);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BadgerBangsLayerAnimBP_C">();
	}
	static class UBadgerBangsLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgerBangsLayerAnimBP_C>();
	}
};

}

