#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassItemTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattlePassItemTracker.BattlePassItemTracker_C.ExecuteUbergraph_BattlePassItemTracker
// 0x0018 (0x0018 - 0x0000)
struct BattlePassItemTracker_C_ExecuteUbergraph_BattlePassItemTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71E7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                K2Node_Event_NumericTextBlock;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HadCompleted;                         // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassItemTracker.BattlePassItemTracker_C.OnInterpEnded
// 0x0010 (0x0010 - 0x0000)
struct BattlePassItemTracker_C_OnInterpEnded final
{
public:
	class UCommonNumericTextBlock*                NumericTextBlock;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadCompleted;                                      // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePassItemTracker.BattlePassItemTracker_C.HandleIntro
// 0x0008 (0x0008 - 0x0000)
struct BattlePassItemTracker_C_HandleIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassItemTracker.BattlePassItemTracker_C.HandleIncrease
// 0x0008 (0x0008 - 0x0000)
struct BattlePassItemTracker_C_HandleIncrease final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassItemTracker.BattlePassItemTracker_C.HandleNumberVisible
// 0x0008 (0x0008 - 0x0000)
struct BattlePassItemTracker_C_HandleNumberVisible final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassItemTracker.BattlePassItemTracker_C.HandleInitialState
// 0x0008 (0x0008 - 0x0000)
struct BattlePassItemTracker_C_HandleInitialState final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

