#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeldObjectLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ExecuteUbergraph_HeldObjectLayerAnimBP
// 0x0004 (0x0004 - 0x0000)
struct HeldObjectLayerAnimBP_C_ExecuteUbergraph_HeldObjectLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSkeletalControl
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSkeletalControl final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemSkeletalControl;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSwimJumpSurfaceEnd final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceEnd;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSwimJumpSurfaceLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceLoop;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSwimJumpFallLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpFallLoop;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSwimJumpStartLoop
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSwimJumpStartLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpStartLoop;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSwimJumpStart
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSwimJumpStart final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpStart;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemRelaxedEntry;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPostPivot;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPrePivot;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStop;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStart;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyLeanAdditive;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyMovement;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogPostPivotAdditive;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogPrePivotAdditive;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogStopAdditive;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogStartAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              Param_ItemFlyModeLoopAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemFlyModeStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemZipLineStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              Param_ItemJetPackJumpAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemJetPackStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              Param_ItemFallLandAdditive;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              Param_ItemFallAdditive;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              Param_ItemJumpLoopAdditive;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              Param_ItemJumpUpAdditive;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              Param_ItemSlopeSliding;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              Param_ItemCrouchTurningAdditive;                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemIdleAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFullBodySprint;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             Param_InputParam;                                  // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemUpperBody;                               // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemAimOffset
// 0x0040 (0x0040 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemAimOffset final
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         Param_AimOffsetAlpha;                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Yaw;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Pitch;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FB2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemAimOffset;                               // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct HeldObjectLayerAnimBP_C_ItemFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFullBodyOverride;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

